Tekla Open API Reference for Tekla Structures 2025
RebarCranking Properties
The RebarCranking type exposes the following members.
Properties
Name | Description
CrankedDistance
 Gets or sets the cranked distance.
CrankedLengthType
 Gets or sets the cranked length type.
CrankedOffset
 Gets or sets the cranked offset.
CrankedRatio
 Gets or sets the cranked ratio.
CrankingType
 Gets or sets the cranking type.
CrankRotation
 Gets or sets the crank rotation.
CrankSide
 Gets or sets the crank side.
CrankStraightLength
 Gets or sets the crank straight length.
Top
See Also
Reference
RebarCranking Class
Tekla.Structures.Model Namespace